//======================================================================
//	工程名称：	Ex1_Receive.spj
//	功能描述：	nRF2401 无线模组例子程序，
//				接收数据
//
//  IDE环境：   SUNPLUS u'nSPTM  IDE 2.0.0（or later）
//	涉及的库：	CMacro1016.lib
//	组成文件：	main.c, nRF2401.c
//				SPCE061A.h, nRF2401.h
//				SPCE061A.inc
//	硬件连接：	
//				无线模组接IOB低8位。
//
//	维护记录：	2006-10-20	v1.0
//======================================================================

//====================================================================================
//文 件 名: main.c
//功能描述: 接收数据
//维护记录: 2006年10月20
//====================================================================================

#include "SPCE061A.h"
#include "nRF2401.h"

unsigned int RxBuf[5];									// 接收缓冲,保存接收到的数据

int main()
{
	nRF2401_Initial();									// nRF2401A初始化

	while((nRF2401_RxStatus()) != 1)
	{
		*P_Watchdog_Clear = 0x0001;						// nRF2401A没有数据请求
	}

	nRF2401_ReceiveByte(RxBuf);							// 接收数据

	while(1)
	{
		*P_Watchdog_Clear = 0x0001;
	}
}
