 /*******************************************************************
   
       文件名称: 8位数据显示程序(专用于开发板)
	   作者:徐修亮
	   版本: 
	   说明:
	   修必记录:
	   日期: 2008 7 21

********************************************************************/ 
  #ifndef __disp_h__
  #define __disp_h__

  #include "xuxiuliang.h"
  #define Port  P0
 /*****************************************************************/
   void delay100us(uchar t);
   void disp(uchar *p);
 
  
   /**************************************
 	函数名称:   void disp(uchar *p)    
	函数功能: 	8位数码显示程序	 能显示8位数据
	入口参数: 	指针p,实示应用时,可在实参中设一数组table[8],然后将table做为地址指针传给形参,比如dsip(table)
	出口参数:  	无
	备注:		 此例中,数组中的数据,不可一次完全赋值,那样代码会很大,应单个赋值
 ****************************************/

   void disp(uchar *p)
   { uchar i,w=0x00;
 
   for(i=0;i<8;i++)
   
  {	Port=*(p+i)|w++<<4;  
     delay100us(5);  
	}
   
    }
   
    void delay100us(uchar t)
  {	
     uchar  j;
	 while(t--)
	   {
	   for (j=50 ;j>0;j--);
	   }
   }
  /***********************************************************************************  
 	void main()			 //此为实现时的实例,可参照其进行参数数调用

 {  uchar table[8];	    //注意数组的单独赋值与一下全赋值其代码生成量相差极大
 
   table[0]=0;table[1]=1;table[2]=2;table[3]=3;table[4]=4;table[5]=5;table[6]=6;table[7]=7;
    
 while(1){disp(table);}

 }
  ************************************************************************************/
	  #endif 
 
