//======================================================================
//	工程名称：	Ex2_Send.spj
//	功能描述：	nRF2401 无线模组例子程序，
//				向发送端发送一个数据，然后进入接收，接收到数据后睡眠
//
//  IDE环境：   SUNPLUS u'nSPTM  IDE 2.0.0（or later）
//	涉及的库：	CMacro1016.lib
//	组成文件：	main.c, nRF2401.c
//				SPCE061A.h, nRF2401.h
//				SPCE061A.inc
//	硬件连接：	
//				无线模组接IOB低8位。
//
//	维护记录：	2006-10-20	v1.0
//======================================================================

//====================================================================================
//文 件 名: main.c
//功能描述: 数据收发
//维护记录: 2006年10月20
//====================================================================================


#include "nRF2401.h"
#include "SPCE061A.h"

unsigned int Address[4] = {0x00,0x00,0x00,0x01};
										// 接收端地址:00 00 00 01
unsigned int RxData[1];					// 接收

int main()
{
	nRF2401_SetAddress(Address,4);		// 设置接收端地址 00 00 00 01
	nRF2401_Initial();					// 初始化nRF2401A
	nRF2401_Mode(1);					// 发送

	nRF2401_SendByte(1);				// 发送数据
	Delay_Us(1000);
	
	nRF2401_Mode(0);					// 接收

	while(nRF2401_RxStatus() == 0)
	{
		*P_Watchdog_Clear = 0x1;
	}
	nRF2401_ReceiveByte(RxData);		// 接收到数据
	
	*P_SystemClock = 0x0007;			// 睡眠
	while(1)
	{
		*P_Watchdog_Clear = 0x1;		
	}	
}
