//======================================================================
//	工程名称：	Ex1_Send.spj
//	功能描述：	nRF2401 无线模组例子程序，
//				向发送端发送一个数组
//
//  IDE环境：   SUNPLUS u'nSPTM  IDE 2.0.0（or later）
//	涉及的库：	CMacro1016.lib
//              SACMv41dx_061A.lib
//	组成文件：	main.c, nRF2401.c
//				SPCE061A.h, nRF2401.h
//				SPCE061A.inc
//	硬件连接：	
//				无线模组接IOB低8位。
//
//	维护记录：	2006-10-20	v1.0
//======================================================================

//====================================================================================
//文 件 名: main.c
//功能描述: 发送数据
//维护记录: 2006年10月20
//====================================================================================

#include "nRF2401.h"
#include "SPCE061A.h"

unsigned int Address[4] = {0x00,0x00,0x01,0xFF};
										// 接收端地址:00 00 01 FF
unsigned int SendBuf[5] = {0x01,0x02,0x03,0x04,0x05};
										// 待发送数据:01 02 03 04 05

int main()
{
	nRF2401_Initial();					// 初始化nRF2401A

	nRF2401_SetAddress(Address,4);		// 设置接收端地址 00 00 01 FF

	nRF2401_SendBuffer_Byte(SendBuf,5);

	while(1)
	{
		*P_Watchdog_Clear = 0x1;
	}
}
