
/**************************************************************
注：本函数用到了定时器0和外中断0
*************************************************************/


#ifndef  __wl_hw_H__
#define  __wl_hw_H__

#include<intrins.h>  //包含_nop_()函数定义的头文件

/***********************************************************/
sbit IR=P3^2;           //将IR位定义为P3.2引脚	  INT0
//sbit BEEP = P3^7; //蜂鸣器控制端口P37 
/**注：一下按键为用户吗。即a[2]码，分别控制三界面切换，时间停止、开始，调节加，调节减，年月日时分切换向右、向左 */
#define wl1 0x09	  
#define wl2 0x43
//#define wl3 0x4A			   //与停止共用一个键
#define wl4 0x15
#define wl5 0x07
#define wl6 0x40
#define wl7 0x44
/**************************************************************/
void Hw_delay1ms();	 //函数功能：延时1ms
void Hw_delay(unsigned char n);	 //函数功能：延时若干毫秒
void Hw_beep();		//蜂鸣器响一声函数
void Hw_Disp();
bit Hw_DeCode();      //函数功能：对4个字节的用户码和键数据码进行解码  	  不同的遥控器、不同的函数只需修改此函数
void Hw_two_2_bcd(unsigned char date) ;  //二进制码转换为压缩型BCD码,并显示
void Hw_Int();
#endif