#include "vs1003.h"
#include "patch.h"
#include "myfun.h"
#include "spi.h"

/*******************************************************

        +------------------------------------+
        |  振南电子 高级外设模块 VS1003B 部分|
        +------------------------------------+

  此源码版权属 振南 全权享有，如欲引用，敬请署名并告知
        严禁随意用于商业目的，违者必究，后果自负
         振南电子 
             ->产品网站 http://www.znmcu.cn/
             ->产品论坛 http://bbs.znmcu.cn/
             ->产品网店 http://shop.znmcu.cn/
             ->产品咨询 QQ:987582714 MSN:yzn07@126.com
	                WW:yzn07				  
********************************************************/

/******************************************************************
 - 功能描述：向VS1003的功能寄存器中写入数据（一个字，即两个字节）
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：addr是功能寄存器的地址
             hdat是要写入的高字节
             ldat是要写入的低字节
 - 返回说明：无返回
 ******************************************************************/

void VS_Write_Reg(unsigned char addr,unsigned char hdat,unsigned char ldat)
{  
 VS_DREQ=1;           //51单片机IO作输入时先置为1
 while(!VS_DREQ);     //VS1003的DREQ为高电平时才接收数据
 VS_XCS=0;            //打开片选，SCI有效，这样才能对功能寄存器进行读写
 SPI_WriteByte(0x02);  //写入操作码0x02   00000010 （功能寄存器写操作）
 SPI_WriteByte(addr);  //写入寄存器地址
 SPI_WriteByte(hdat);  //写入高字节
 SPI_WriteByte(ldat);  //写入低字节   
 VS_XCS=1;            //关闭片选，SCI无效
}

/******************************************************************
 - 功能描述：从VS1003的功能寄存器中读取数据（一个字）
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：addr是功能寄存器的地址
 - 返回说明：返回从VS1003的功能寄存器中读到的值 
 ******************************************************************/

unsigned int VS_Read_Reg(unsigned char addr) 
{
 unsigned int temp=0;
 VS_DREQ=1;               
 while(!VS_DREQ); //VS1003的DREQ为高电平时才接收数据

 VS_XCS=0;	      //打开片选，SCI有效
 SPI_WriteByte(0x03);  //读出操作码0x03   00000011（功能寄存器读操作）
 SPI_WriteByte(addr);  //写入寄存器地址

 temp=SPI_ReadByte();  //读高字节
 temp<<=8;
 temp|=SPI_ReadByte(); //读取低字节，与高字节拼成一个字

 VS_XCS=1;	      //关闭片选，SCI无效
 return temp;     //返回读到的值
}

/******************************************************************
 - 功能描述：VS1003软复位及初始化（设置时钟频率及音量）
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：无
 - 返回说明：无
 ******************************************************************/

void VS_Reset()
{
 VS_XRESET=1; 
 delay(100);
 VS_XRESET=0;
 delay(100);
 VS_XRESET=1; //硬件复位，XRESET低电平有效
 delay(100);

 VS_Write_Reg(0x00,0x08,0x04);//软件复位，向0号寄存器写入0x0804   SM_SDINEW为1   SM_RESET为1
 VS_Write_Reg(0x03,0x98,0x00);//时钟设置，向3号寄存器写入0x9800   SC_MULT  为4   SC_ADD  为3   SC_FREQ为0
 VS_Write_Reg(0x0b,0x00,0x00);//音量设置，左右声道均最大音量
   
 VS_XDCS=0;	     //打开数据片选，注意此时XCS（片选）为高电平，SDI有效
 SPI_WriteByte(0);    //写入数据，这里写入4个0，是无关数据，用来启动数据传输
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 VS_XDCS=1;	    //关闭数据片选，SDI无效
} 

/******************************************************************
 - 功能描述：向VS1003写入一个字节的音频数据（即用于播放的数据）
                注：调用前先将VS_XDCS置为0，打开数据片选
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：dat是要写入的字节
 - 返回说明：无
 ******************************************************************/

void VS_Send_Dat(unsigned char dat) 
{
 VS_XDCS=0;    //打开SDI，此时可以向VS1003写入音频数据
 VS_DREQ=1;
 while(!VS_DREQ);  //VS1003的DREQ为高才能写入数据
 SPI_WriteByte(dat);//通过SPI向VS1003写入一个字节的音频数据
 VS_XDCS=1;   //关闭SDI
}

/******************************************************************
 - 功能描述：向VS1003写入2048个0，用于清空VS1003的数据缓冲区
             注：在播放完一个完整的音频（如一首完整的MP3）后，调用
             此函数，清空VS1003数据缓冲区，为下面的音频数据（如下
             一首MP3）作准备。        
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：无
 - 返回说明：无
 ******************************************************************/

void VS_Flush_Buffer() 
{
 unsigned int i;
 VS_XDCS=0;	   //打开数据片选，即开启SDI传输
 for(i=0;i<2048;i++)
 {
  VS_Send_Dat(0);
 }
 VS_XDCS=1;        //关闭数据片选
}

/******************************************************************
 - 功能描述：正弦测试，这是测试VS1003芯片是否正常的有效手段！！
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：x决定了正弦测试中产生的正弦波的频率，直接影响听到的
             声音的频率      
 - 返回说明：无
 ******************************************************************/

void VS_sin_test(unsigned char x)
{ 
 VS_Write_Reg(0x00,0x08,0x20);//启动测试，向0号寄存器写入0x0820   SM_SDINEW为1   SM_TEST为1
 VS_DREQ=1;
 while(!VS_DREQ);   //等待DREQ变为高电平
 VS_XDCS=0;	    //打开数据片选 SDI有效
 SPI_WriteByte(0x53);//写入以下8个字节,进入正弦测试
 SPI_WriteByte(0xef); 
 SPI_WriteByte(0x6e);
 SPI_WriteByte(x);   //参数x用来调整正弦测试中正弦波的频率   FsIdx (b7~b5):采样率表索引   S (b4~b0):正弦波的跃速   频率F=Fs X S / 128
 SPI_WriteByte(0);   //比如x=126 (0b 011 11110) FsIdx=011=3   Fs=22050Hz   S=11110=30    F=22050Hz X 30 /128 =5168 Hz
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 delay(60000);      //这里延时一段时间，为了听到“正弦音”
 delay(60000);
 delay(60000);
 delay(60000);
 delay(60000);
 delay(60000);
 SPI_WriteByte(0x45);//写入以下8个字节，退出正弦测试
 SPI_WriteByte(0x78); 
 SPI_WriteByte(0x69);
 SPI_WriteByte(0x74);
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 SPI_WriteByte(0);
 VS_XDCS=1;	    //关闭数据片选 ，SDI无效
} 

/******************************************************************
 - 功能描述：为VS1003打补丁，获得实时频谱
             注：atab与dtab是VS1003频谱功能补丁码，在patch.h中
 - 隶属模块：VS1003B模块
 - 函数属性：外部，用户可调用
 - 参数说明：无    
 - 返回说明：无
 ******************************************************************/

void LoadPatch() 
{
 unsigned int i;
 for(i=0;i<943;i++)
 {
  VS_Write_Reg(atab[i],dtab[i]>>8,dtab[i]&0xff);
 }
}



 

